package com.tags.list.copyRandomList;

import test.BaseSolution;
import test.Node;

import java.util.HashMap;

//给定一个链表，每个节点包含一个额外增加的随机指针，该指针可以指向链表中的任何节点或空节点。
// 要求返回这个链表的 深拷贝。
// 我们用一个由 n 个节点组成的链表来表示输入/输出中的链表。每个节点用一个 [val, random_index] 表示：
// val：一个表示 Node.val 的整数。
// random_index：随机指针指向的节点索引（范围从 0 到 n-1）；如果不指向任何节点，则为 null 。
// 示例 1：
// 输入：head = [[7,null],[13,0],[11,4],[10,2],[1,0]]
//输出：[[7,null],[13,0],[11,4],[10,2],[1,0]]
// 示例 2：
// 输入：head = [[1,1],[2,1]]
//输出：[[1,1],[2,1]]
// 示例 3：
// 输入：head = [[3,null],[3,0],[3,null]]
//输出：[[3,null],[3,0],[3,null]]
// 示例 4：
//
// 输入：head = []
//输出：[]
//解释：给定的链表为空（空指针），因此返回 null。
// 提示：
// -10000 <= Node.val <= 10000
// Node.random 为空（null）或指向链表中的节点。
// 节点数目不超过 1000 。
//
// Related Topics 哈希表 链表
// 👍 417 👎 0

/**
 * time: O(n) space(1);
 * 该解法是典型的hashmap的应用：题意中，深拷贝意味着所有拷贝后获取的所有节点都一样，
 * 巧妙的地方在于，复制两次，第一次只复制节点，并且为下一次复制next和random做准备，
 * 由于原节点的key和新节点的key值是一样的，所以可以通过原有的key来复制新的next和random
 */
public class Solution extends BaseSolution {
    public Node copyRandomList(Node head) {

        if (head == null) return null;

        HashMap<Node, Node> map = new HashMap<>();

        // 第一遍获取所有的节点
        Node cur = head;
        while (cur != null) {
            map.put(cur, new Node(cur.val));
            cur = cur.next;
        }

        // 第二遍将所有的节点连接起来
        cur = head;
        while (cur != null) {
            map.get(cur).next = map.get(cur.next);
            map.get(cur).random = map.get(cur.random);
            cur = cur.next;
        }
        return map.get(head);
    }
}
